# @see: https://thoughtbot.com/blog/brewfile-a-gemfile-but-for-homebrew
# @see: https://github.com/pndurette/mac-setup/blob/master/.Brewfile
# @see: https://github.com/dropkick/dot/blob/main/Brewfile

# Taps
tap "beeftornado/rmtree"
tap "shivammathur/php"

# Utilities
brew "duf"
brew "fastfetch"
brew "ffmpeg"
brew "gdu"
brew "gh"
brew "git"
brew "git-extras"
brew "htop"
brew "jq"
brew "mas"
brew "mkcert"
brew "nano"
brew "p7zip"
brew "rename"
brew "rmtree"
brew "tmux"
brew "trash"
brew "tree"
brew "yt-dlp"
brew "yq"
brew "zsh-autosuggestions"

# GNU
brew "ack"
brew "findutils"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnutls"
brew "grep"
brew "coreutils"
brew "binutils"
brew "diffutils"
brew "gzip"
brew "watch"
brew "wget"

# Languages
brew "go"
brew "goreleaser"
brew "node"
brew "shivammathur/php/php"
brew "ruby"

# Package Managers
brew "composer"
brew "yarn"

# Casks
cask "1password"
cask "alt-tab"
cask "appcleaner"
cask "balenaetcher"
cask "calibre"
cask "chatgpt"
cask "claude"
cask "cyberduck"
cask "dbngin"
cask "docker"
cask "dropbox"
cask "filebot"
cask "firefox"
cask "github"
cask "google-chrome"
cask "handbrake"
cask "herd"
cask "heroic"
cask "hiddenbar"
cask "imageoptim"
cask "kap"
cask "keepassxc"
cask "keepingyouawake"
cask "lulu"
cask "mac-mouse-fix"
cask "maestral"
cask "markedit"
cask "mullvadvpn"
cask "namechanger"
cask "netnewswire"
cask "obs"
cask "ollama-app"
cask "pika"
cask "phpstorm"
cask "rectangle"
cask "sequel-ace"
cask "spotify"
cask "steam"
cask "sublime-merge"
cask "sublime-text"
cask "table-tool"
cask "tableplus"
cask "the-unarchiver"
cask "tomatobar"
cask "transmission"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
cask "yacreader"
cask "yubico-yubikey-manager"
cask "zed"

# AppStore
mas "Magnet", id: 441258766
mas "ToothFairy", id: 1191449274
mas "TrashMe 3", id: 1490879410

# AppStore Apple
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Keynote", id: 409183694
